[Target-C40179A9D7DAD484]
Image=Default.png
SizeX=64
SizeY=64
Opacity=100

[General-C40179A9D7DAD484]

# 压缩包细分
[zip]
State=Enabled
Rules=*.zip
Action=$0
Destination=Y:\我的文件\压缩包\zip

[rar]
State=Enabled
Rules=*.rar
Action=$0
Destination=Y:\我的文件\压缩包\rar

[7z]
State=Enabled
Rules=*.7z
Action=$0
Destination=Y:\我的文件\压缩包\7z

[tar]
State=Enabled
Rules=*.tar
Action=$0
Destination=Y:\我的文件\压缩包\tar

[gz]
State=Enabled
Rules=*.gz;*.tgz
Action=$0
Destination=Y:\我的文件\压缩包\gz

[bz2]
State=Enabled
Rules=*.bz2;*.tbz2
Action=$0
Destination=Y:\我的文件\压缩包\bz2

[xz]
State=Enabled
Rules=*.xz;*.txz
Action=$0
Destination=Y:\我的文件\压缩包\xz

[iso]
State=Enabled
Rules=*.iso
Action=$0
Destination=Y:\我的文件\压缩包\iso

[cab]
State=Enabled
Rules=*.cab
Action=$0
Destination=Y:\我的文件\压缩包\cab

[lzh]
State=Enabled
Rules=*.lzh
Action=$0
Destination=Y:\我的文件\压缩包\lzh

[arj]
State=Enabled
Rules=*.arj
Action=$0
Destination=Y:\我的文件\压缩包\arj

[z]
State=Enabled
Rules=*.z
Action=$0
Destination=Y:\我的文件\压缩包\z

[lzma]
State=Enabled
Rules=*.lzma
Action=$0
Destination=Y:\我的文件\压缩包\lzma

[lzo]
State=Enabled
Rules=*.lzo
Action=$0
Destination=Y:\我的文件\压缩包\lzo

[jar]
State=Enabled
Rules=*.jar
Action=$0
Destination=Y:\我的文件\压缩包\jar

[ace]
State=Enabled
Rules=*.ace
Action=$0
Destination=Y:\我的文件\压缩包\ace

[zoo]
State=Enabled
Rules=*.zoo
Action=$0
Destination=Y:\我的文件\压缩包\zoo

# 图片细分
[images_jpg]
State=Enabled
Rules=*.jpg;*.jpeg
Action=$0
Destination=Y:\我的文件\图片\JPG

[images_png]
State=Enabled
Rules=*.png
Action=$0
Destination=Y:\我的文件\图片\PNG

[images_gif]
State=Enabled
Rules=*.gif
Action=$0
Destination=Y:\我的文件\图片\GIF

[images_bmp]
State=Enabled
Rules=*.bmp
Action=$0
Destination=Y:\我的文件\图片\BMP

[images_tiff]
State=Enabled
Rules=*.tiff;*.tif
Action=$0
Destination=Y:\我的文件\图片\TIFF

[images_webp]
State=Enabled
Rules=*.webp
Action=$0
Destination=Y:\我的文件\图片\WEBP

[images_raw]
State=Enabled
Rules=*.raw;*.cr2;*.nef;*.arw;*.dng
Action=$0
Destination=Y:\我的文件\图片\RAW

[images_heic]
State=Enabled
Rules=*.heic;*.heif
Action=$0
Destination=Y:\我的文件\图片\HEIC

[images_svg]
State=Enabled
Rules=*.svg
Action=$0
Destination=Y:\我的文件\图片\SVG

[images_ico]
State=Enabled
Rules=*.ico
Action=$0
Destination=Y:\我的文件\图片\ICO

[images_emf]
State=Enabled
Rules=*.emf
Action=$0
Destination=Y:\我的文件\图片\EMF

[images_wmf]
State=Enabled
Rules=*.wmf
Action=$0
Destination=Y:\我的文件\图片\WMF

[images_psd]
State=Enabled
Rules=*.psd
Action=$0
Destination=Y:\我的文件\图片\PSD

[images_ai]
State=Enabled
Rules=*.ai
Action=$0
Destination=Y:\我的文件\图片\AI

[images_jp2]
State=Enabled
Rules=*.jp2;*.j2k
Action=$0
Destination=Y:\我的文件\图片\JPEG2000

[images_exr]
State=Enabled
Rules=*.exr
Action=$0
Destination=Y:\我的文件\图片\EXR

[images_tga]
State=Enabled
Rules=*.tga
Action=$0
Destination=Y:\我的文件\图片\TGA

[images_iff]
State=Enabled
Rules=*.iff
Action=$0
Destination=Y:\我的文件\图片\IFF

[images_cur]
State=Enabled
Rules=*.cur
Action=$0
Destination=Y:\我的文件\图片\CUR

# 视频细分
[videos_mp4]
State=Enabled
Rules=*.mp4
Action=$0
Destination=Y:\我的文件\视频\MP4

[videos_avi]
State=Enabled
Rules=*.avi
Action=$0
Destination=Y:\我的文件\视频\AVI

[videos_mkv]
State=Enabled
Rules=*.mkv
Action=$0
Destination=Y:\我的文件\视频\MKV

[videos_mov]
State=Enabled
Rules=*.mov
Action=$0
Destination=Y:\我的文件\视频\MOV

[videos_wmv]
State=Enabled
Rules=*.wmv
Action=$0
Destination=Y:\我的文件\视频\WMV

[videos_flv]
State=Enabled
Rules=*.flv
Action=$0
Destination=Y:\我的文件\视频\FLV

[videos_webm]
State=Enabled
Rules=*.webm
Action=$0
Destination=Y:\我的文件\视频\WEBM

[videos_m4v]
State=Enabled
Rules=*.m4v
Action=$0
Destination=Y:\我的文件\视频\M4V

[videos_3gp]
State=Enabled
Rules=*.3gp
Action=$0
Destination=Y:\我的文件\视频\3GP

[videos_rmvb]
State=Enabled
Rules=*.rmvb;*.rm
Action=$0
Destination=Y:\我的文件\视频\RMVB

# 音频细分
[audio_mp3]
State=Enabled
Rules=*.mp3
Action=$0
Destination=Y:\我的文件\音频\MP3

[audio_wav]
State=Enabled
Rules=*.wav
Action=$0
Destination=Y:\我的文件\音频\WAV

[audio_flac]
State=Enabled
Rules=*.flac
Action=$0
Destination=Y:\我的文件\音频\FLAC

[audio_aac]
State=Enabled
Rules=*.aac
Action=$0
Destination=Y:\我的文件\音频\AAC

[audio_ogg]
State=Enabled
Rules=*.ogg
Action=$0
Destination=Y:\我的文件\音频\OGG

[audio_wma]
State=Enabled
Rules=*.wma
Action=$0
Destination=Y:\我的文件\音频\WMA

[audio_m4a]
State=Enabled
Rules=*.m4a
Action=$0
Destination=Y:\我的文件\音频\M4A

[audio_ape]
State=Enabled
Rules=*.ape
Action=$0
Destination=Y:\我的文件\音频\APE

[audio_alac]
State=Enabled
Rules=*.alac
Action=$0
Destination=Y:\我的文件\音频\ALAC

# 文档细分
[documents_pdf]
State=Enabled
Rules=*.pdf
Action=$0
Destination=Y:\我的文件\文档\PDF

[documents_word]
State=Enabled
Rules=*.doc;*.docx
Action=$0
Destination=Y:\我的文件\文档\Word

[documents_excel]
State=Enabled
Rules=*.xls;*.xlsx
Action=$0
Destination=Y:\我的文件\文档\Excel

[documents_powerpoint]
State=Enabled
Rules=*.ppt;*.pptx
Action=$0
Destination=Y:\我的文件\文档\PowerPoint

[documents_txt]
State=Enabled
Rules=*.txt
Action=$0
Destination=Y:\我的文件\文档\文本文件

[documents_rtf]
State=Enabled
Rules=*.rtf
Action=$0
Destination=Y:\我的文件\文档\RTF

[documents_markdown]
State=Enabled
Rules=*.md;*.markdown
Action=$0
Destination=Y:\我的文件\文档\Markdown

[documents_csv]
State=Enabled
Rules=*.csv
Action=$0
Destination=Y:\我的文件\文档\CSV

[documents_xml]
State=Enabled
Rules=*.xml
Action=$0
Destination=Y:\我的文件\文档\XML

[documents_json]
State=Enabled
Rules=*.json
Action=$0
Destination=Y:\我的文件\文档\JSON

# 安装程序细分
[installers_exe]
State=Enabled
Rules=*.exe
Action=$0
Destination=Y:\我的文件\安装程序\EXE

[installers_msi]
State=Enabled
Rules=*.msi
Action=$0
Destination=Y:\我的文件\安装程序\MSI

[installers_dmg]
State=Enabled
Rules=*.dmg
Action=$0
Destination=Y:\我的文件\安装程序\DMG

[installers_pkg]
State=Enabled
Rules=*.pkg
Action=$0
Destination=Y:\我的文件\安装程序\PKG

[installers_deb]
State=Enabled
Rules=*.deb
Action=$0
Destination=Y:\我的文件\安装程序\DEB

[installers_rpm]
State=Enabled
Rules=*.rpm
Action=$0
Destination=Y:\我的文件\安装程序\RPM

[installers_apk]
State=Enabled
Rules=*.apk
Action=$0
Destination=Y:\我的文件\安装程序\APK

[installers_ipa]
State=Enabled
Rules=*.ipa
Action=$0
Destination=Y:\我的文件\安装程序\IPA

# 代码文件细分
[code_python]
State=Enabled
Rules=*.py;*.pyc;*.pyo
Action=$0
Destination=Y:\我的文件\代码文件\Python

[code_javascript]
State=Enabled
Rules=*.js;*.jsx
Action=$0
Destination=Y:\我的文件\代码文件\JavaScript

[code_html]
State=Enabled
Rules=*.html;*.htm
Action=$0
Destination=Y:\我的文件\代码文件\HTML

[code_css]
State=Enabled
Rules=*.css
Action=$0
Destination=Y:\我的文件\代码文件\CSS

[code_java]
State=Enabled
Rules=*.java;*.class
Action=$0
Destination=Y:\我的文件\代码文件\Java

[code_cpp]
State=Enabled
Rules=*.cpp;*.cc;*.cxx
Action=$0
Destination=Y:\我的文件\代码文件\C++

[code_c]
State=Enabled
Rules=*.c
Action=$0
Destination=Y:\我的文件\代码文件\C

[code_php]
State=Enabled
Rules=*.php
Action=$0
Destination=Y:\我的文件\代码文件\PHP

[code_sql]
State=Enabled
Rules=*.sql
Action=$0
Destination=Y:\我的文件\代码文件\SQL

[code_batch]
State=Enabled
Rules=*.bat;*.cmd
Action=$0
Destination=Y:\我的文件\代码文件\批处理

[code_powershell]
State=Enabled
Rules=*.ps1
Action=$0
Destination=Y:\我的文件\代码文件\PowerShell

[code_shell]
State=Enabled
Rules=*.sh
Action=$0
Destination=Y:\我的文件\代码文件\Shell

[code_config]
State=Enabled
Rules=*.ini;*.cfg;*.conf;*.config
Action=$0
Destination=Y:\我的文件\代码文件\配置文件

# 字体文件
[fonts]
State=Enabled
Rules=*.ttf;*.otf;*.woff;*.woff2;*.eot
Action=$0
Destination=Y:\我的文件\字体

# 临时文件
[temp]
State=Enabled
Rules=*.tmp;*.temp;*.log;*.cache
Action=$0
Destination=Y:\我的文件\临时文件

# 图标文件
[icons]
State=Enabled
Rules=*.ico;*.icns;*.cur;*.ani
Action=$0
Destination=Y:\我的文件\图标

# 办公文档补充
[documents_odt]
State=Enabled
Rules=*.odt
Action=$0
Destination=Y:\我的文件\文档\ODT

[documents_wps]
State=Enabled
Rules=*.wps
Action=$0
Destination=Y:\我的文件\文档\WPS

[documents_xlsm]
State=Enabled
Rules=*.xlsm
Action=$0
Destination=Y:\我的文件\文档\Excel

[documents_pptm]
State=Enabled
Rules=*.pptm
Action=$0
Destination=Y:\我的文件\文档\PowerPoint

# 电子书格式
[ebooks_epub]
State=Enabled
Rules=*.epub
Action=$0
Destination=Y:\我的文件\电子书\EPUB

[ebooks_mobi]
State=Enabled
Rules=*.mobi
Action=$0
Destination=Y:\我的文件\电子书\MOBI

[ebooks_azw3]
State=Enabled
Rules=*.azw3
Action=$0
Destination=Y:\我的文件\电子书\AZW3

[ebooks_fb2]
State=Enabled
Rules=*.fb2
Action=$0
Destination=Y:\我的文件\电子书\FB2

[ebooks_djvu]
State=Enabled
Rules=*.djvu
Action=$0
Destination=Y:\我的文件\电子书\DJVU

# 设计文件
[design_cdr]
State=Enabled
Rules=*.cdr
Action=$0
Destination=Y:\我的文件\设计文件\CDR

[design_sketch]
State=Enabled
Rules=*.sketch
Action=$0
Destination=Y:\我的文件\设计文件\Sketch

[design_xd]
State=Enabled
Rules=*.xd
Action=$0
Destination=Y:\我的文件\设计文件\XD

[design_fig]
State=Enabled
Rules=*.fig
Action=$0
Destination=Y:\我的文件\设计文件\Figma

# 数据库文件
[database_db]
State=Enabled
Rules=*.db
Action=$0
Destination=Y:\我的文件\数据库\DB

[database_sqlite]
State=Enabled
Rules=*.sqlite
Action=$0
Destination=Y:\我的文件\数据库\SQLite

[database_mdb]
State=Enabled
Rules=*.mdb
Action=$0
Destination=Y:\我的文件\数据库\MDB

[database_accdb]
State=Enabled
Rules=*.accdb
Action=$0
Destination=Y:\我的文件\数据库\ACCDB

# 程序开发相关
[code_go]
State=Enabled
Rules=*.go
Action=$0
Destination=Y:\我的文件\代码文件\Go

[code_rs]
State=Enabled
Rules=*.rs
Action=$0
Destination=Y:\我的文件\代码文件\Rust

[code_ts]
State=Enabled
Rules=*.ts
Action=$0
Destination=Y:\我的文件\代码文件\TypeScript

[code_tsx]
State=Enabled
Rules=*.tsx
Action=$0
Destination=Y:\我的文件\代码文件\TypeScript

[code_cs]
State=Enabled
Rules=*.cs
Action=$0
Destination=Y:\我的文件\代码文件\CSharp

[code_swift]
State=Enabled
Rules=*.swift
Action=$0
Destination=Y:\我的文件\代码文件\Swift

[code_kt]
State=Enabled
Rules=*.kt
Action=$0
Destination=Y:\我的文件\代码文件\Kotlin

[code_dart]
State=Enabled
Rules=*.dart
Action=$0
Destination=Y:\我的文件\代码文件\Dart

[code_lua]
State=Enabled
Rules=*.lua
Action=$0
Destination=Y:\我的文件\代码文件\Lua

# 脚本文件
[script_vb]
State=Enabled
Rules=*.vb
Action=$0
Destination=Y:\我的文件\脚本\VB

[script_vbs]
State=Enabled
Rules=*.vbs
Action=$0
Destination=Y:\我的文件\脚本\VBS

[script_pl]
State=Enabled
Rules=*.pl
Action=$0
Destination=Y:\我的文件\脚本\Perl

[script_rb]
State=Enabled
Rules=*.rb
Action=$0
Destination=Y:\我的文件\脚本\Ruby

[script_r]
State=Enabled
Rules=*.r
Action=$0
Destination=Y:\我的文件\脚本\R

[script_m]
State=Enabled
Rules=*.m
Action=$0
Destination=Y:\我的文件\脚本\Matlab

[script_groovy]
State=Enabled
Rules=*.groovy
Action=$0
Destination=Y:\我的文件\脚本\Groovy

# 虚拟机/镜像文件
[vm_vmdk]
State=Enabled
Rules=*.vmdk
Action=$0
Destination=Y:\我的文件\虚拟机镜像\VMDK

[vm_vdi]
State=Enabled
Rules=*.vdi
Action=$0
Destination=Y:\我的文件\虚拟机镜像\VDI

[vm_vhd]
State=Enabled
Rules=*.vhd
Action=$0
Destination=Y:\我的文件\虚拟机镜像\VHD

[vm_img]
State=Enabled
Rules=*.img
Action=$0
Destination=Y:\我的文件\虚拟机镜像\IMG

# 矢量动画/多媒体
[media_swf]
State=Enabled
Rules=*.swf
Action=$0
Destination=Y:\我的文件\多媒体\SWF

[media_fla]
State=Enabled
Rules=*.fla
Action=$0
Destination=Y:\我的文件\多媒体\FLA

# 临时/缓存文件补充
[temp_bak]
State=Enabled
Rules=*.bak
Action=$0
Destination=Y:\我的文件\临时文件

[temp_old]
State=Enabled
Rules=*.old
Action=$0
Destination=Y:\我的文件\临时文件

[temp_swp]
State=Enabled
Rules=*.swp
Action=$0
Destination=Y:\我的文件\临时文件

[temp_tilde]
State=Enabled
Rules=*~
Action=$0
Destination=Y:\我的文件\临时文件

[temp_dmp]
State=Enabled
Rules=*.dmp
Action=$0
Destination=Y:\我的文件\临时文件

# 可执行文件安全分类
[exec_js]
State=Enabled
Rules=*.js
Action=$0
Destination=Y:\我的文件\可执行文件\JS

[exec_vbs]
State=Enabled
Rules=*.vbs
Action=$0
Destination=Y:\我的文件\可执行文件\VBS

[exec_bat]
State=Enabled
Rules=*.bat
Action=$0
Destination=Y:\我的文件\可执行文件\BAT

[exec_cmd]
State=Enabled
Rules=*.cmd
Action=$0
Destination=Y:\我的文件\可执行文件\CMD

[exec_msi]
State=Enabled
Rules=*.msi
Action=$0
Destination=Y:\我的文件\可执行文件\MSI

[exec_exe]
State=Enabled
Rules=*.exe
Action=$0
Destination=Y:\我的文件\可执行文件\EXE

# 其它分类（放最后）
[others]
State=Enabled
Rules=*.*
Action=$0
Destination=Y:\我的文件\其它

